[Survived] BlockStatement
src/App.js:3:43
 import { useState } from 'react';
 
-function Square({ value, onSquareClick }) {
-  return (
-    <button className="square" onClick={onSquareClick}>
-      {value}
-    </button>
-  );
-}
+function Square({ value, onSquareClick }) {}
 
 function Board({ boardNumber, xIsNext, squares, onPlay, isActive }) {

[NoCoverage] BlockStatement
src/App.js:13:27
 
 function Board({ boardNumber, xIsNext, squares, onPlay, isActive }) {
   let boardWinner = calculateBoardWinner(squares, boardNumber)
-  function handleClick(i) {
-    if (!isActive || boardWinner || squares[(boardNumber * 9) + i]) {
-      return;
-    }
-    const nextSquares = squares.slice();
-    if (xIsNext) {
-      nextSquares[i] = 'X';
-    } else {
-      nextSquares[i] = 'O';
-    }
-    onPlay(nextSquares, i % 9);
-  }
+  function handleClick(i) {}
 
   let classNames = "board";

[NoCoverage] ArithmeticOperator
src/App.js:14:45
 function Board({ boardNumber, xIsNext, squares, onPlay, isActive }) {
   let boardWinner = calculateBoardWinner(squares, boardNumber)
   function handleClick(i) {
-    if (!isActive || boardWinner || squares[(boardNumber * 9) + i]) {
+    if (!isActive || boardWinner || squares[boardNumber * 9 - i]) {
       return;
     }

[NoCoverage] BlockStatement
src/App.js:14:69
 function Board({ boardNumber, xIsNext, squares, onPlay, isActive }) {
   let boardWinner = calculateBoardWinner(squares, boardNumber)
   function handleClick(i) {
-    if (!isActive || boardWinner || squares[(boardNumber * 9) + i]) {
-      return;
-    }
+    if (!isActive || boardWinner || squares[(boardNumber * 9) + i]) {}
     const nextSquares = squares.slice();
     if (xIsNext) {

[NoCoverage] MethodExpression
src/App.js:17:25
     if (!isActive || boardWinner || squares[(boardNumber * 9) + i]) {
       return;
     }
-    const nextSquares = squares.slice();
+    const nextSquares = squares;
     if (xIsNext) {
       nextSquares[i] = 'X';

[NoCoverage] ConditionalExpression
src/App.js:18:9
       return;
     }
     const nextSquares = squares.slice();
-    if (xIsNext) {
+    if (true) {
       nextSquares[i] = 'X';
     } else {

[NoCoverage] ConditionalExpression
src/App.js:18:9
       return;
     }
     const nextSquares = squares.slice();
-    if (xIsNext) {
+    if (false) {
       nextSquares[i] = 'X';
     } else {

[NoCoverage] BlockStatement
src/App.js:20:12
     const nextSquares = squares.slice();
     if (xIsNext) {
       nextSquares[i] = 'X';
-    } else {
-      nextSquares[i] = 'O';
-    }
+    } else {}
     onPlay(nextSquares, i % 9);
   }

[NoCoverage] ArithmeticOperator
src/App.js:23:25
     } else {
       nextSquares[i] = 'O';
     }
-    onPlay(nextSquares, i % 9);
+    onPlay(nextSquares, i * 9);
   }
 

[Survived] StringLiteral
src/App.js:26:20
     onPlay(nextSquares, i % 9);
   }
 
-  let classNames = "board";
+  let classNames = "";
   if (!isActive) {
     classNames = classNames.concat(" inactive");

[NoCoverage] BlockStatement
src/App.js:27:18
   }
 
   let classNames = "board";
-  if (!isActive) {
-    classNames = classNames.concat(" inactive");
-  }
+  if (!isActive) {}
   let overlayClasses = "board-overlay";
   if (boardWinner) {

[Survived] BooleanLiteral
src/App.js:27:7
   }
 
   let classNames = "board";
-  if (!isActive) {
+  if (isActive) {
     classNames = classNames.concat(" inactive");
   }

[NoCoverage] BlockStatement
src/App.js:31:20
     classNames = classNames.concat(" inactive");
   }
   let overlayClasses = "board-overlay";
-  if (boardWinner) {
-    overlayClasses = overlayClasses.concat(" active");
-  }
+  if (boardWinner) {}
 
   return (

[Survived] ConditionalExpression
src/App.js:31:7
     classNames = classNames.concat(" inactive");
   }
   let overlayClasses = "board-overlay";
-  if (boardWinner) {
+  if (true) {
     overlayClasses = overlayClasses.concat(" active");
   }

[NoCoverage] ArithmeticOperator
src/App.js:38:90
   return (
     <div className={classNames}>
       <div className="board-row">
-        <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber * 9) + 0)} />
+        <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber / 9) + 0)} />
         <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
         <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />

[Survived] ArrowFunction
src/App.js:38:71
   return (
     <div className={classNames}>
       <div className="board-row">
-        <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber * 9) + 0)} />
+        <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => undefined} />
         <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
         <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />

[Survived] ArrowFunction
src/App.js:39:71
     <div className={classNames}>
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber * 9) + 0)} />
-        <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
+        <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => undefined} />
         <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />
       </div>

[Survived] ArithmeticOperator
src/App.js:39:33
     <div className={classNames}>
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber * 9) + 0)} />
-        <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
+        <Square value={squares[(boardNumber / 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
         <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />
       </div>

[NoCoverage] ArithmeticOperator
src/App.js:40:90
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber * 9) + 0)} />
         <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
-        <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />
+        <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber / 9) + 2)} />
       </div>
       <div className="board-row">

[Survived] ArrowFunction
src/App.js:40:71
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 0]} onSquareClick={() => handleClick((boardNumber * 9) + 0)} />
         <Square value={squares[(boardNumber * 9) + 1]} onSquareClick={() => handleClick((boardNumber * 9) + 1)} />
-        <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />
+        <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => undefined} />
       </div>
       <div className="board-row">

[NoCoverage] ArithmeticOperator
src/App.js:43:90
         <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />
       </div>
       <div className="board-row">
-        <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber * 9) + 3)} />
+        <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber / 9) + 3)} />
         <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber * 9) + 4)} />
         <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />

[NoCoverage] ArithmeticOperator
src/App.js:43:89
         <Square value={squares[(boardNumber * 9) + 2]} onSquareClick={() => handleClick((boardNumber * 9) + 2)} />
       </div>
       <div className="board-row">
-        <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber * 9) + 3)} />
+        <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick(boardNumber * 9 - 3)} />
         <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber * 9) + 4)} />
         <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />

[Survived] ArrowFunction
src/App.js:44:71
       </div>
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber * 9) + 3)} />
-        <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber * 9) + 4)} />
+        <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => undefined} />
         <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />
       </div>

[NoCoverage] ArithmeticOperator
src/App.js:44:90
       </div>
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber * 9) + 3)} />
-        <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber * 9) + 4)} />
+        <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber / 9) + 4)} />
         <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />
       </div>

[Survived] ArrowFunction
src/App.js:45:71
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber * 9) + 3)} />
         <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber * 9) + 4)} />
-        <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />
+        <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => undefined} />
       </div>
       <div className="board-row">

[NoCoverage] ArithmeticOperator
src/App.js:45:90
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 3]} onSquareClick={() => handleClick((boardNumber * 9) + 3)} />
         <Square value={squares[(boardNumber * 9) + 4]} onSquareClick={() => handleClick((boardNumber * 9) + 4)} />
-        <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />
+        <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber / 9) + 5)} />
       </div>
       <div className="board-row">

[NoCoverage] ArithmeticOperator
src/App.js:48:89
         <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />
       </div>
       <div className="board-row">
-        <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
+        <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick(boardNumber * 9 - 6)} />
         <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
         <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />

[Survived] ArithmeticOperator
src/App.js:48:32
         <Square value={squares[(boardNumber * 9) + 5]} onSquareClick={() => handleClick((boardNumber * 9) + 5)} />
       </div>
       <div className="board-row">
-        <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
+        <Square value={squares[boardNumber * 9 - 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
         <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
         <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />

[Survived] ArrowFunction
src/App.js:49:71
       </div>
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
-        <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
+        <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => undefined} />
         <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />
       </div>

[Survived] ArithmeticOperator
src/App.js:49:32
       </div>
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
-        <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
+        <Square value={squares[boardNumber * 9 - 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
         <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />
       </div>

[NoCoverage] ArithmeticOperator
src/App.js:50:90
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
         <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
-        <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />
+        <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber / 9) + 8)} />
       </div>
       <div className={overlayClasses}>{boardWinner}</div>

[Survived] ArithmeticOperator
src/App.js:50:32
       <div className="board-row">
         <Square value={squares[(boardNumber * 9) + 6]} onSquareClick={() => handleClick((boardNumber * 9) + 6)} />
         <Square value={squares[(boardNumber * 9) + 7]} onSquareClick={() => handleClick((boardNumber * 9) + 7)} />
-        <Square value={squares[(boardNumber * 9) + 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />
+        <Square value={squares[boardNumber * 9 - 8]} onSquareClick={() => handleClick((boardNumber * 9) + 8)} />
       </div>
       <div className={overlayClasses}>{boardWinner}</div>

[Killed] ArrayDeclaration
src/App.js:58:42
 }
 
 export default function Game() {
-  const [history, setHistory] = useState([Array(81).fill(null)]);
+  const [history, setHistory] = useState([]);
   const [currentMove, setCurrentMove] = useState(0);
   let [activeBoard, setActiveBoard] = useState(Array(9).fill(true));
killedBy: App renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] ArrayDeclaration
src/App.js:58:43
 }
 
 export default function Game() {
-  const [history, setHistory] = useState([Array(81).fill(null)]);
+  const [history, setHistory] = useState([Array().fill(null)]);
   const [currentMove, setCurrentMove] = useState(0);
   let [activeBoard, setActiveBoard] = useState(Array(9).fill(true));

[Survived] BooleanLiteral
src/App.js:60:62
 export default function Game() {
   const [history, setHistory] = useState([Array(81).fill(null)]);
   const [currentMove, setCurrentMove] = useState(0);
-  let [activeBoard, setActiveBoard] = useState(Array(9).fill(true));
+  let [activeBoard, setActiveBoard] = useState(Array(9).fill(false));
   const xIsNext = currentMove % 2 === 0;
   const currentSquares = history[currentMove];

[Survived] ConditionalExpression
src/App.js:61:19
   const [history, setHistory] = useState([Array(81).fill(null)]);
   const [currentMove, setCurrentMove] = useState(0);
   let [activeBoard, setActiveBoard] = useState(Array(9).fill(true));
-  const xIsNext = currentMove % 2 === 0;
+  const xIsNext = true;
   const currentSquares = history[currentMove];
 

[Survived] ConditionalExpression
src/App.js:61:19
   const [history, setHistory] = useState([Array(81).fill(null)]);
   const [currentMove, setCurrentMove] = useState(0);
   let [activeBoard, setActiveBoard] = useState(Array(9).fill(true));
-  const xIsNext = currentMove % 2 === 0;
+  const xIsNext = false;
   const currentSquares = history[currentMove];
 

[NoCoverage] BlockStatement
src/App.js:64:46
   const xIsNext = currentMove % 2 === 0;
   const currentSquares = history[currentMove];
 
-  function handlePlay(nextSquares, position) {
-    const nextHistory = [...history.slice(0, currentMove + 1), nextSquares];
-    setHistory(nextHistory);
-    setCurrentMove(nextHistory.length - 1);
-    let nextActiveBoard = activeBoard.slice().fill(false);
-    if (calculateBoardWinner(nextSquares, position)) {
-      nextActiveBoard = nextActiveBoard.map((value, index) => {
-        return !(calculateBoardWinner(nextSquares, index));
-      });
-    } else {
-      nextActiveBoard[position] = true;
-    }
-    setActiveBoard(nextActiveBoard);
-  }
+  function handlePlay(nextSquares, position) {}
 
   function jumpTo(nextMove) {

[NoCoverage] ArithmeticOperator
src/App.js:65:46
   const currentSquares = history[currentMove];
 
   function handlePlay(nextSquares, position) {
-    const nextHistory = [...history.slice(0, currentMove + 1), nextSquares];
+    const nextHistory = [...history.slice(0, currentMove - 1), nextSquares];
     setHistory(nextHistory);
     setCurrentMove(nextHistory.length - 1);

[NoCoverage] MethodExpression
src/App.js:65:29
   const currentSquares = history[currentMove];
 
   function handlePlay(nextSquares, position) {
-    const nextHistory = [...history.slice(0, currentMove + 1), nextSquares];
+    const nextHistory = [...history, nextSquares];
     setHistory(nextHistory);
     setCurrentMove(nextHistory.length - 1);

[NoCoverage] ArithmeticOperator
src/App.js:67:20
   function handlePlay(nextSquares, position) {
     const nextHistory = [...history.slice(0, currentMove + 1), nextSquares];
     setHistory(nextHistory);
-    setCurrentMove(nextHistory.length - 1);
+    setCurrentMove(nextHistory.length + 1);
     let nextActiveBoard = activeBoard.slice().fill(false);
     if (calculateBoardWinner(nextSquares, position)) {

[NoCoverage] BooleanLiteral
src/App.js:68:52
     const nextHistory = [...history.slice(0, currentMove + 1), nextSquares];
     setHistory(nextHistory);
     setCurrentMove(nextHistory.length - 1);
-    let nextActiveBoard = activeBoard.slice().fill(false);
+    let nextActiveBoard = activeBoard.slice().fill(true);
     if (calculateBoardWinner(nextSquares, position)) {
       nextActiveBoard = nextActiveBoard.map((value, index) => {

[NoCoverage] MethodExpression
src/App.js:68:27
     const nextHistory = [...history.slice(0, currentMove + 1), nextSquares];
     setHistory(nextHistory);
     setCurrentMove(nextHistory.length - 1);
-    let nextActiveBoard = activeBoard.slice().fill(false);
+    let nextActiveBoard = activeBoard.fill(false);
     if (calculateBoardWinner(nextSquares, position)) {
       nextActiveBoard = nextActiveBoard.map((value, index) => {

[NoCoverage] BlockStatement
src/App.js:69:54
     setHistory(nextHistory);
     setCurrentMove(nextHistory.length - 1);
     let nextActiveBoard = activeBoard.slice().fill(false);
-    if (calculateBoardWinner(nextSquares, position)) {
-      nextActiveBoard = nextActiveBoard.map((value, index) => {
-        return !(calculateBoardWinner(nextSquares, index));
-      });
-    } else {
+    if (calculateBoardWinner(nextSquares, position)) {} else {
       nextActiveBoard[position] = true;
     }

[NoCoverage] ConditionalExpression
src/App.js:69:9
     setHistory(nextHistory);
     setCurrentMove(nextHistory.length - 1);
     let nextActiveBoard = activeBoard.slice().fill(false);
-    if (calculateBoardWinner(nextSquares, position)) {
+    if (false) {
       nextActiveBoard = nextActiveBoard.map((value, index) => {
         return !(calculateBoardWinner(nextSquares, index));

[NoCoverage] BlockStatement
src/App.js:70:63
     setCurrentMove(nextHistory.length - 1);
     let nextActiveBoard = activeBoard.slice().fill(false);
     if (calculateBoardWinner(nextSquares, position)) {
-      nextActiveBoard = nextActiveBoard.map((value, index) => {
-        return !(calculateBoardWinner(nextSquares, index));
-      });
+      nextActiveBoard = nextActiveBoard.map((value, index) => {});
     } else {
       nextActiveBoard[position] = true;

[NoCoverage] BooleanLiteral
src/App.js:71:16
     let nextActiveBoard = activeBoard.slice().fill(false);
     if (calculateBoardWinner(nextSquares, position)) {
       nextActiveBoard = nextActiveBoard.map((value, index) => {
-        return !(calculateBoardWinner(nextSquares, index));
+        return calculateBoardWinner(nextSquares, index);
       });
     } else {

[NoCoverage] BlockStatement
src/App.js:73:12
       nextActiveBoard = nextActiveBoard.map((value, index) => {
         return !(calculateBoardWinner(nextSquares, index));
       });
-    } else {
-      nextActiveBoard[position] = true;
-    }
+    } else {}
     setActiveBoard(nextActiveBoard);
   }

[NoCoverage] BooleanLiteral
src/App.js:74:35
         return !(calculateBoardWinner(nextSquares, index));
       });
     } else {
-      nextActiveBoard[position] = true;
+      nextActiveBoard[position] = false;
     }
     setActiveBoard(nextActiveBoard);

[NoCoverage] BlockStatement
src/App.js:79:29
     setActiveBoard(nextActiveBoard);
   }
 
-  function jumpTo(nextMove) {
-    setCurrentMove(nextMove);
-  }
+  function jumpTo(nextMove) {}
 
   const winner = calculateOverallWinner(currentSquares);

[NoCoverage] BlockStatement
src/App.js:85:15
 
   const winner = calculateOverallWinner(currentSquares);
   let status;
-  if (winner) {
-    status = 'Winner: ' + winner;
-    activeBoard = Array(9).fill(false);
-  } else {
+  if (winner) {} else {
     status = 'Next player: ' + (xIsNext ? 'X' : 'O');
   }

[Survived] ConditionalExpression
src/App.js:85:7
 
   const winner = calculateOverallWinner(currentSquares);
   let status;
-  if (winner) {
+  if (true) {
     status = 'Winner: ' + winner;
     activeBoard = Array(9).fill(false);

[NoCoverage] StringLiteral
src/App.js:86:14
   const winner = calculateOverallWinner(currentSquares);
   let status;
   if (winner) {
-    status = 'Winner: ' + winner;
+    status = "" + winner;
     activeBoard = Array(9).fill(false);
   } else {

[NoCoverage] BooleanLiteral
src/App.js:87:33
   let status;
   if (winner) {
     status = 'Winner: ' + winner;
-    activeBoard = Array(9).fill(false);
+    activeBoard = Array(9).fill(true);
   } else {
     status = 'Next player: ' + (xIsNext ? 'X' : 'O');

[NoCoverage] ArrayDeclaration
src/App.js:87:19
   let status;
   if (winner) {
     status = 'Winner: ' + winner;
-    activeBoard = Array(9).fill(false);
+    activeBoard = Array().fill(false);
   } else {
     status = 'Next player: ' + (xIsNext ? 'X' : 'O');

[Survived] BlockStatement
src/App.js:88:10
   if (winner) {
     status = 'Winner: ' + winner;
     activeBoard = Array(9).fill(false);
-  } else {
-    status = 'Next player: ' + (xIsNext ? 'X' : 'O');
-  }
+  } else {}
 
   const moves = history.map((squares, move) => {

[Survived] StringLiteral
src/App.js:89:14
     status = 'Winner: ' + winner;
     activeBoard = Array(9).fill(false);
   } else {
-    status = 'Next player: ' + (xIsNext ? 'X' : 'O');
+    status = "" + (xIsNext ? 'X' : 'O');
   }
 

[Survived] BlockStatement
src/App.js:92:48
     status = 'Next player: ' + (xIsNext ? 'X' : 'O');
   }
 
-  const moves = history.map((squares, move) => {
-    let description;
-    if (move > 0) {
-      description = 'Go to move #' + move;
-    } else {
-      description = 'Go to game start';
-    }
-    return (
-      <li key={move}>
-        <button onClick={() => jumpTo(move)}>{description}</button>
-      </li>
-    );
-  });
+  const moves = history.map((squares, move) => {});
 
   return (

[Survived] ConditionalExpression
src/App.js:94:9
 
   const moves = history.map((squares, move) => {
     let description;
-    if (move > 0) {
+    if (false) {
       description = 'Go to move #' + move;
     } else {

[Survived] ConditionalExpression
src/App.js:94:9
 
   const moves = history.map((squares, move) => {
     let description;
-    if (move > 0) {
+    if (true) {
       description = 'Go to move #' + move;
     } else {

[NoCoverage] StringLiteral
src/App.js:95:21
   const moves = history.map((squares, move) => {
     let description;
     if (move > 0) {
-      description = 'Go to move #' + move;
+      description = "" + move;
     } else {
       description = 'Go to game start';

[Survived] BlockStatement
src/App.js:96:12
     let description;
     if (move > 0) {
       description = 'Go to move #' + move;
-    } else {
-      description = 'Go to game start';
-    }
+    } else {}
     return (
       <li key={move}>

[Survived] ArrowFunction
src/App.js:101:26
     }
     return (
       <li key={move}>
-        <button onClick={() => jumpTo(move)}>{description}</button>
+        <button onClick={() => undefined}>{description}</button>
       </li>
     );

[Survived] BlockStatement
src/App.js:130:53
   );
 }
 
-function calculateBoardWinner(squares, boardNumber) {
-  const lines = [
-    [0, 1, 2],
-    [3, 4, 5],
-    [6, 7, 8],
-    [0, 3, 6],
-    [1, 4, 7],
-    [2, 5, 8],
-    [0, 4, 8],
-    [2, 4, 6],
-  ];
-  for (let i = 0; i < lines.length; i++) {
-    const [a, b, c] = lines[i];
-    if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
-      return squares[(boardNumber * 9) + a];
-    }
-  }
-  return null;
-}
+function calculateBoardWinner(squares, boardNumber) {}
 
 function calculateOverallWinner(squares) {

[Survived] ArrayDeclaration
src/App.js:134:5
   const lines = [
     [0, 1, 2],
     [3, 4, 5],
-    [6, 7, 8],
+    [],
     [0, 3, 6],
     [1, 4, 7],

[Killed] EqualityOperator
src/App.js:141:19
     [0, 4, 8],
     [2, 4, 6],
   ];
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; i <= lines.length; i++) {
     const [a, b, c] = lines[i];
     if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
killedBy: App renders without crashing
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] UpdateOperator
src/App.js:141:37
     [0, 4, 8],
     [2, 4, 6],
   ];
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; i < lines.length; i--) {
     const [a, b, c] = lines[i];
     if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
killedBy: App renders without crashing
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[NoCoverage] BlockStatement
src/App.js:143:179
   ];
   for (let i = 0; i < lines.length; i++) {
     const [a, b, c] = lines[i];
-    if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
-      return squares[(boardNumber * 9) + a];
-    }
+    if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {}
   }
   return null;

[NoCoverage] ConditionalExpression
src/App.js:143:112
   ];
   for (let i = 0; i < lines.length; i++) {
     const [a, b, c] = lines[i];
-    if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
+    if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && true) {
       return squares[(boardNumber * 9) + a];
     }

[NoCoverage] ArithmeticOperator
src/App.js:144:22
   for (let i = 0; i < lines.length; i++) {
     const [a, b, c] = lines[i];
     if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
-      return squares[(boardNumber * 9) + a];
+      return squares[boardNumber * 9 - a];
     }
   }

[NoCoverage] ArithmeticOperator
src/App.js:144:23
   for (let i = 0; i < lines.length; i++) {
     const [a, b, c] = lines[i];
     if (squares[(boardNumber * 9) + a] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + b] && squares[(boardNumber * 9) + a] === squares[(boardNumber * 9) + c]) {
-      return squares[(boardNumber * 9) + a];
+      return squares[(boardNumber / 9) + a];
     }
   }

[Survived] BlockStatement
src/App.js:150:42
   return null;
 }
 
-function calculateOverallWinner(squares) {
-  let boards = Array(9);
-  for (let i = 0; i < 9; i++) {
-    boards[i] = calculateBoardWinner(squares, i);
-  }
-  return calculateBoardWinner(boards, 0);
-}
+function calculateOverallWinner(squares) {}
