[Survived] BlockStatement
src/App.js:152:31
 
 function calculateOverallWinner(squares) {
   let boards = Array(9);
-  for (let i = 0; i < 9; i++) {
-    boards[i] = calculateBoardWinner(squares, i);
-  }
+  for (let i = 0; i < 9; i++) {}
   return calculateBoardWinner(boards, 0);
 }

[Survived] EqualityOperator
src/App.js:152:19
 
 function calculateOverallWinner(squares) {
   let boards = Array(9);
-  for (let i = 0; i < 9; i++) {
+  for (let i = 0; i >= 9; i++) {
     boards[i] = calculateBoardWinner(squares, i);
   }
